
## Plan Result (dev)

[CI link](https://us-east-1.console.aws.amazon.com/codebuild/home?region=us-east-1#/builds/tf-on-codebuild-project:4bd730f5-20e9-4488-8d64-d24ff2c57942/view/new)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 1 to change, 4 to destroy.</code></pre>

* Update
  * aws_s3_bucket.default
* Delete
  * aws_s3_bucket.default3
  * aws_s3_bucket_public_access_block.default3
* Replace
  * aws_s3_bucket.default2
  * aws_s3_bucket_public_access_block.default2


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_s3_bucket.default will be updated in-place
  ~ resource "aws_s3_bucket" "default" {
      ~ force_destroy               = true -> false
        id                          = "tf-on-codebuild-example-20220712132035094900000001"
        tags                        = {}
        # (10 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_s3_bucket.default2 must be replaced
-/+ resource "aws_s3_bucket" "default2" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::tf-on-codebuild-example-2-20220817025948187400000001" -> (known after apply)
      ~ bucket                      = "tf-on-codebuild-example-2-20220817025948187400000001" -> (known after apply)
      ~ bucket_domain_name          = "tf-on-codebuild-example-2-20220817025948187400000001.s3.amazonaws.com" -> (known after apply)
      ~ bucket_prefix               = "tf-on-codebuild-example-2-" -> "tf-on-codebuild-example-2-replaced" # forces replacement
      ~ bucket_regional_domain_name = "tf-on-codebuild-example-2-20220817025948187400000001.s3.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z3AQBSTGFYJSTF" -> (known after apply)
      ~ id                          = "tf-on-codebuild-example-2-20220817025948187400000001" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      + policy                      = (known after apply)
      ~ region                      = "us-east-1" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      - tags                        = {} -> null
      ~ tags_all                    = {} -> (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (1 unchanged attribute hidden)

      + cors_rule {
          + allowed_headers = (known after apply)
          + allowed_methods = (known after apply)
          + allowed_origins = (known after apply)
          + expose_headers  = (known after apply)
          + max_age_seconds = (known after apply)
        }

      - grant {
          - id          = "ae354015f5b1f3e15bcc7a47e52be3ed5f03ca7bf90a160b273428eac0640acc" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }
      + grant {
          + id          = (known after apply)
          + permissions = (known after apply)
          + type        = (known after apply)
          + uri         = (known after apply)
        }

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = (known after apply)
          + enabled                                = (known after apply)
          + id                                     = (known after apply)
          + prefix                                 = (known after apply)
          + tags                                   = (known after apply)

          + expiration {
              + date                         = (known after apply)
              + days                         = (known after apply)
              + expired_object_delete_marker = (known after apply)
            }

          + noncurrent_version_expiration {
              + days = (known after apply)
            }

          + noncurrent_version_transition {
              + days          = (known after apply)
              + storage_class = (known after apply)
            }

          + transition {
              + date          = (known after apply)
              + days          = (known after apply)
              + storage_class = (known after apply)
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = (known after apply)
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + delete_marker_replication_status = (known after apply)
              + id                               = (known after apply)
              + prefix                           = (known after apply)
              + priority                         = (known after apply)
              + status                           = (known after apply)

              + destination {
                  + account_id         = (known after apply)
                  + bucket             = (known after apply)
                  + replica_kms_key_id = (known after apply)
                  + storage_class      = (known after apply)

                  + access_control_translation {
                      + owner = (known after apply)
                    }

                  + metrics {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }

                  + replication_time {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }
                }

              + filter {
                  + prefix = (known after apply)
                  + tags   = (known after apply)
                }

              + source_selection_criteria {
                  + sse_kms_encrypted_objects {
                      + enabled = (known after apply)
                    }
                }
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = (known after apply)

              + apply_server_side_encryption_by_default {
                  + kms_master_key_id = (known after apply)
                  + sse_algorithm     = (known after apply)
                }
            }
        }

      ~ versioning {
          ~ enabled    = false -> (known after apply)
          ~ mfa_delete = false -> (known after apply)
        }

      + website {
          + error_document           = (known after apply)
          + index_document           = (known after apply)
          + redirect_all_requests_to = (known after apply)
          + routing_rules            = (known after apply)
        }
    }

  # aws_s3_bucket.default3 will be destroyed
  # (because aws_s3_bucket.default3 is not in configuration)
  - resource "aws_s3_bucket" "default3" {
      - arn                         = "arn:aws:s3:::tf-on-codebuild-example-3-20220817030146230700000001" -> null
      - bucket                      = "tf-on-codebuild-example-3-20220817030146230700000001" -> null
      - bucket_domain_name          = "tf-on-codebuild-example-3-20220817030146230700000001.s3.amazonaws.com" -> null
      - bucket_prefix               = "tf-on-codebuild-example-3-" -> null
      - bucket_regional_domain_name = "tf-on-codebuild-example-3-20220817030146230700000001.s3.amazonaws.com" -> null
      - force_destroy               = true -> null
      - hosted_zone_id              = "Z3AQBSTGFYJSTF" -> null
      - id                          = "tf-on-codebuild-example-3-20220817030146230700000001" -> null
      - object_lock_enabled         = false -> null
      - region                      = "us-east-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {} -> null
      - tags_all                    = {} -> null

      - grant {
          - id          = "ae354015f5b1f3e15bcc7a47e52be3ed5f03ca7bf90a160b273428eac0640acc" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # aws_s3_bucket_public_access_block.default2 must be replaced
-/+ resource "aws_s3_bucket_public_access_block" "default2" {
      ~ bucket                  = "tf-on-codebuild-example-2-20220817025948187400000001" -> (known after apply) # forces replacement
      ~ id                      = "tf-on-codebuild-example-2-20220817025948187400000001" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_s3_bucket_public_access_block.default3 will be destroyed
  # (because aws_s3_bucket_public_access_block.default3 is not in configuration)
  - resource "aws_s3_bucket_public_access_block" "default3" {
      - block_public_acls       = true -> null
      - block_public_policy     = true -> null
      - bucket                  = "tf-on-codebuild-example-3-20220817030146230700000001" -> null
      - id                      = "tf-on-codebuild-example-3-20220817030146230700000001" -> null
      - ignore_public_acls      = true -> null
      - restrict_public_buckets = true -> null
    }

Plan: 2 to add, 1 to change, 4 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobID":"tf-on-codebuild-project:4bd730f5-20e9-4488-8d64-d24ff2c57942","PRNumber":3,"Program":"tfcmt","SHA1":"d98397c0cbf44432303feaf410e16c83b276756f","Target":"dev","Vars":{}} -->